Status/Status.tex
% Created 2016-05-12 Thu 16:05
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Nidish Narayanaa}
\date{\today}
\title{IIST FOSS Club Activities and Presentations}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents


\section{About}
\label{sec-1}
  This is IIST's Free and Open Source Software (FOSS) Club started
as an effort in promoting FOSS based research in the fields of
Science and Engineering.
\subsection{Agenda}
\label{sec-1-1}
   The Agendas of the club include Presentations, lectures, demos, 
and other activities organized to increase the members' confidence
in using FOSS software platforms for their everyday academic use.
\subsection{Plan}
\label{sec-1-2}
   A set of presentations (once or twice a month) are planned for 
each year which will stand as the backbone of the functioning of 
the club. All the activities will be accomodated either during these
slots or at other slots.


\section{Work}
\label{sec-2}
\subsection{Sessions}
\label{sec-2-1}
\begin{enumerate}
\item Introduction to FOSS and Linux
\item Linux Installation Fest
\item Introduction to Scientific Computing with Linux 
\begin{itemize}
\item I. Introduction   
\begin{itemize}
\item The Linux File System
\item File Handling in Linux
\end{itemize}
\item II. Basic Tools
\begin{itemize}
\item Emacs
\item Octave
\item Gnuplot
\end{itemize}
\end{itemize}
\item Basic Computing
\begin{itemize}
\item Bash
\item C/C++
\item Python
\end{itemize}
\item Software Development
\begin{itemize}
\item GNU Make
\item Version Control Systems
\begin{itemize}
\item RCS
\item CVS
\item Git
\end{itemize}
\end{itemize}
\end{enumerate}


\section{Schedules}
\label{sec-3}
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}
